app/controllers/invoices_controller.rb

INSERT INTO "advances" ("user_id", "debtor", "date", "invoice_number", "advance_per", "status", "final_amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def pay_invoice

    puts "logged: #{$logged}"
    @advance = Advance.new(debtor: params[:debtor],date: Date.today, invoice_number: params[:invoice_number], final_amount: params[:final_amount], status: params[:status],advance_per: params[:advance_per], user_id: $logged)

    puts "result: #{@advance.advance_per.to_f/100*@advance.final_amount}"

    @advance.final_amount = @advance.advance_per.to_f/100*@advance.final_amount



    puts "final_amount #{@advance.final_amount}"

    respond_to do |format|
      if @advance.save

SELECT "advances".* FROM "advances" WHERE "advances"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    $advance = Advance.find_by(id: params[:id])

SELECT "advances".* FROM "advances" WHERE "advances"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "advances" SET "debtor" = ?, "invoice_number" = ?, "advance_per" = ?, "status" = ?, "final_amount" = ?, "user_id" = ?, "updated_at" = ? WHERE "advances"."id" = ?  [["debtor", "POGGERS"], ["invoice_number", 3], ["advance_per", 3.0], ["status", "3"], ["final_amount", 3.0], ["user_id", 2], ["updated_at", "2021-11-08 16:41:35.200827"], ["id", 12]]
---
  def update

    $advance = Advance.find_by(id: $advance_id)

    respond_to do |format|
      if $advance.update(advance_params)

SELECT "advances".* FROM "advances" WHERE "advances"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "advances" WHERE "advances"."id" = ?  [["id", 12]]
---
  def delete_advance
    @invoice = Advance.find_by(id: params[:id])

    @invoice.destroy