app/controllers/pages_controller.rb

  def home

    @pagy, @invoices = pagy(Advance.all, items: 10)

    $logged = session[:user_id]
    if $logged
      @advances_current_user = User.find_by(id: $logged).advances
---
SELECT "advances".* FROM "advances" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT "advances".* FROM "advances" WHERE "advances"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]