app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "1"], ["password", "1"], ["created_at", "2021-11-05 19:23:48.086454"], ["updated_at", "2021-11-05 19:23:48.086454"]]
---
  def create
    flash.discard
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "1"], ["LIMIT", 1]]
---
  def check_login
    puts "LOGIN"
    check_user = User.find_by(email: params[:email])